from flask import Flask, render_template

app = Flask(__name__)

items = [
    {
        "id": 1,
        "title": "สภาพแผงข้างรถบรรทุกอ้อยต้องแข็งแรง เป็นแนวตรง",
        "details": [
            "รถที่แผงข้างเป็นไม้ต้องไม่ผุหรือแตกร้าว",
            "น็อตยึดแผงข้างต้องแน่นหนาและแข็งแรง",
            "แผงข้างด้านล่างกระบะเทเลอร์ต้องติดแผ่นเหล็กเรียบด้านในยาวตลอดแนว ให้มีความสูง 1.2 ม. และหนา 3 มม. ขึ้นไป",
        ],
        "warnings": [
            "หากแผงข้างผุ อ้อยอาจเสียบทะลุและทำให้เสียหาย",
            "แผงข้างอาจหลุดตกลงสะพานลำเลียงอ้อย ทำให้ต้องหยุดเครื่องจักร",
            "หากมีช่องว่างเยอะ จะทำให้อ้อยเข้าไปเสียบบริเวณนั้น ใช้เวลาดั๊มนานจากการต้องเคลียร์อ้อยในกระบะและทำให้เกิดความเสียหายข้างกระบะ",
        ],
    },
    {
        "id": 2,
        "title": "รถเทเลอร์ ขาค้ำยันต้องแข็งแรงปลอดภัย โครงสร้างกระบะต้องได้มาตรฐาน",
        "details": ["รถเทเลอร์ต้องมีขาค้ำยัน 4 ขา แข็งแรงปลอดภัย"],
        "warnings": [
            "ขาค้ำยันต้องมี 4 ขา เพื่อความปลอดภัยในการคล้องโซ่และดั๊มพ์ ซึ่งอาจทำให้พนักงานคล้องโซ่ถูกรถบรรทุกทับได้"
        ],
    },
    {
        "id": 3,
        "title": "รถเทเลอร์ รถพ่วง ต้องมีจุดสำหรับคล้องโซ่ เชื่อมยึดให้แข็งแรง ต้องได้มาตรฐาน",
        "details": [
            "จุดคล้องโซ่แข็งแรง (ถ้าคานคล้องเป็นเหล็กไม่น้อยกว่า 6 นิ้ว ต้องมีหูช้างคล้องโซ่ที่หนาไม่น้อยกว่า 18 มม. พร้อมรอยเชื่อมที่แข็งแรง)"
        ],
        "warnings": [
            "กรณีจุดคล้องโซ่ที่ไม่แข็งแรงหรือรับแรงไม่ได้ จะส่งผลให้รถบรรทุกตกดั๊มพ์ จากจุดคล้องโซ่"
        ],
    },
    {
        "id": 4,
        "title": "รถบรรทุกอ้อยที่มีดั๊มพ์ทุกคันต้องมีการล็อคดั๊มพ์ของตัวกระบะ",
        "details": [
            "รถบรรทุกอ้อยที่มีดั๊มพ์ทุกคันต้องมีการล็อคดั๊มของตัวกระบะ"
        ],
        "warnings": [
            "เพื่อป้องกันไม่ให้กระบะยกขึ้น ขณะดั๊มพ์อ้อยซึ่งจะทำให้น้ำหนักรถไปอยูที่ท้ายรถ ทำให้ล้อรถบรรทุกข้าม Stopper และทำให้รถตกดั๊มพ์"
        ],
    },
    {
        "id": 5,
        "title": "เสาหลักกันอ้อยหล่นด้านข้างต้องยึดให้แข็งแรง",
        "details": [
            "เสาที่ใช้ทำหลักต้องมีความแข็งแรง ไม่ใช้ต้นอ้อยทำเป็นเสากันอ้อยหล่น (เสาหลักต้องมีระยะห่าง 80-90 ซม.)"
        ],
        "warnings": [
            "ตรวจสอบความแข็งแรงของเสาค้ำ เนื่องจากเสาค้ำที่ไม่แข็งแรงจะทำให้เสาร่วงหล่นบนสะพานไซด์ ส่งผลกระทบต่อการลำเลียงอ้อยและกระบวนการหีบอ้อย"
        ],
    },
    {
        "id": 6,
        "title": "การต่อท้ายกระบะรถบรรทุกอ้อยรถตัด ชุดสลักปลดล็อคต้องแข็งแรงและสลักต้องการต่อยาวถึงท้ายกระบะ",
        "details": [
            "หากชุดสลักปลดสั้นทำให้คนเอื้อมไปไกลเพื่อไปปลดสลัก อาจจะทำให้เกิดอันตราย คนพลัดตกลงไปในสะพาน ซึ่งเป็นอันตรายถึงชีวิต"
        ],
        "warnings": [
            "ตรวจเนื่องจากถ้าไม่แข็งแรงจะเสียเวลาในการดั๊มพ์",
            "จุดปลดสลักที่ไม่ถูกตำแหน่งส่งผลต่อความปลอดภัยกับคนขับในการปลดล็อค ซึ่งอาจตกสะพานหรืออ้อยทับได้",
        ],
    },
    {
        "id": 7,
        "title": "การยึดยางอะไหล่ ชุดล็อคยางอะไหล่ต้องไม่หลวมคลอนและใช้น็อตยึดยางให้แน่น",
        "details": [
            "หากล้ออะไหล่หลุดออกจากตัวรถจะส่งผลให้ตกลงลงไปยังสะพานทำให้ต้องหยุดการหีบอ้อย"
        ],
        "warnings": [
            "ชุดยางอะไหล่ ถ้ายึดไม่แน่นหลุดเข้าไปในเครื่องจักรแล้ว จะส่งผลให้เครื่องจักรเสียหายและต้องหยุดหีบอ้อย"
        ],
    },
    {
        "id": 8,
        "title": "เหล็กรางรถไฟรับฝาท้ายต้องยึดติดแข็งแรง ไม่หลุดออกมาจากตัวรถและขวางทางอ้อย",
        "details": [
            "หากเหล็กรางหลุดออกจากตัวรถจะส่งผลให้ตกลงไปยังสะพานทำให้ต้องหยุดการหีบ"
        ],
        "warnings": [
            "เหล็กรางรถไฟท้ายรถ ถ้าหลุดเข้าไปในเครื่อง จะทำให้เครื่องจักรเสียหาย ต้องหยุดการหีบ"
        ],
    },
    {
        "id": 9,
        "title": "กันชนด้านท้าย และแผ่นบังโคลนจะต้องมีความสูงจากพื้นไม่น้อยกว่า 60 ซม.",
        "details": [
            "กันชนด้านท้ายรถต้องไม่ขวางการชน ระหว่างล้อรถบรรทุกกับ Stopper"
        ],
        "warnings": [
            "เพื่อป้องกันความเสียหายเวลารถถอยชนยันล้อ แผ่นบังโคลนจะส่งผลต่อการถอยรถ ล้อรถไม่ชน Stopper ส่งผลให้ตอนดั๊มพ์อ้อยจะสามารถขยับได้ แล้วทำให้รถบรรทุกตกดั๊มพ์"
        ],
    },
    {
        "id": 10,
        "title": "ลมยางล้อรถบรรทุกอ้อย ต้องมีความดันมากกว่า 130 ปอนด์/ตร.นิ้ว",
        "details": ["ต้องมีการเช็คแรงดันล้อยางรถบรรทุก ก่อนบรรทุกอ้อย"],
        "warnings": [
            "ตรวจเนื่องจากแรงดันลมยางรถบรรทุกที่ถอยชน Stopper ถ้าต่ำกว่ามาตรฐาน สามารถทำให้ล้อข้าม Stopper ได้เมื่ออ้อยลงสะพาน"
        ],
    },
    {
        "id": 11,
        "title": "การต่อแขนลากจูงรถพ่วงต้องมีความแข็งแรง",
        "details": [
            "เหล็กทำแขนลากต้องมีความหนา 12 มม. ขึ้นไป และการเชื่อมต้องเชื่อมเต็มเนื้อรวมเป็นชิ้นเดียวกันเท่านั้น"
        ],
        "warnings": [
            "แขนลากจูงรถพ่วงถ้าไม่แข็งแรง ชำรุดจะเกิดผลกระทบต่ออันตรายด้านการขนส่งและการเข้าดั๊มพ์อ้อยในบริเวณลานลูกหีบ"
        ],
    },
    {
        "id": 12,
        "title": "การต่อเติมท้ายรถบรรทุกอ้อยต้องแข็งแรง",
        "details": ["ต้องมีการเชื่อมยึดติดกับตัวรถให้แน่นหนา และแข็งแรง"],
        "warnings": [
            "กรณีท้ายรถบรรทุกยึดติดไม่แน่นกับตัวรถจะส่งผลให้ขณะดั๊มพ์อ้อย น้ำหนักอ้อยจะไปกดที่ท้ายรถบรรทุก ส่งผลให้ท้ายรถบรรทุกตกสะพาน ทำให้หยุดหีบอ้อย"
        ],
    },
]


@app.route("/")
def home():

    return render_template(
        "index.html",
        items=items
    )


if __name__ == "__main__":

    app.run(
        host="0.0.0.0",
        port=5000,
        debug=True
    )
