import json
from flask import Flask, render_template

app = Flask(__name__)

items = [
    {
        "id": 1,
        "title": "สภาพแผงข้างรถบรรทุกอ้อยต้องแข็งแรง เป็นแนวตรง",
        "details": [
            "ต้องไม่มีอ้อยเสียบออกมาที่ด้านนอกแผงข้างรถบรรทุก",
        ],
        "warnings": [
            "- หากแผงข้างมีการผุหรือชำรุด จะทำให้อย้อยเข้าไปเสียบบริเวณนั้นได้ ขณะดั๊มพ์อ้อย และทำให้เกิดความเสียหายต่อแผงข้างกระบะและยังทำให้ใช้เวลาในการดั๊มพ์อ้อยนานขึ้น จากการต้องเคลียร์อ้อยในกระบะ",
            "- เมื่อฝาข้างที่ไม่แข็งแรงสามารถหลุดตกลงไปในสะพานลำเลียงอ้อย ชำรุดจากการทับกระแทกของลำอ้อย และต้องเสียเวลาในการหยุดเพื่อนำแผงข้างขึ้นจากสะพานลำเลียงอ้อย",
        ],
    },
    {
        "id": 2,
        "title": "สภาพแผงข้างรถบรรทุกต้องแข็งแรง เป็นแนวตรง",
        "details": ["แผงข้างด้านล่างกระบะเทเลอร์ต้องติดแผ่นเหล็กเรียบด้านในยาวตลอดแนว ให้มีความสูง 1.2 ม. และหนา 3 มม. ขึ้นไป"],
        "warnings": [
            "- หากมีช่องว่างเยอะ จะทำให้อย้อยเข้าไปเสียบบริเวณนั้น ใช้เวลาดั๊มพ์อ้อยนานจากการต้องเคลียร์อ้อยในกระบะและทำให้เกิดความเสียหายต่อแผงข้างกระบะ"
        ],
    },
    {
        "id": 3,
        "title": "รถเทเลอร์ ขาค้ำยันต้องแข็งแรงปลอดภัย โครงสร้างกระบะต้องได้ตามมาตรฐาน",
        "details": [
            "รถเทเลอร์ต้องมีขาค้ำยัน 4 ขา แข็งแรงปลอดภัย"
        ],
        "warnings": [
            "- ขาค้ำยันต้องมี 4 ขา เพื่อความปลอดภัยในการคล้องโซ่และดั๊มพ์ ซึ่งอาจทำให้พนักงานคล้องโซ่ถูกรถบรรทุกทับได้"
        ],
    },
    {
        "id": 4,
        "title": "รถเทเลอร์ รถพ่วง ต้องมีจุดสำหรับคล้องโซ่ เชื่อมยึดให้แข็งแรง ต้องได้ตามมาตรฐาน",
        "details": [
            "จุดคล้องโซ่แข็งแรง ขณะดั๊มพ์อ้อยต้องไม่ฉีกขาด"
        ],
        "warnings": [
            "- กรณีจุดคล้องโซ่มีไม่แข็งแรงหรือรับแรงไม่ได้ จะส่งผลให้รถบรรทุกอ้อยตกดั๊มพ์ จากจุดคล้องโซ่ฉีกขาด Stopper และทำให้รถตกดั๊มพ์",
            "- จุดคล้องโซ่แข็งแรง (ถ้าคานคล้องเป็นเหล็กไม่น้อยกว่า 6 นิ้ว ต้องมีหูช้างคล้องโซ่ที่หนาไม่น้อยกว่า 18 มม. พร้อมรอยเชื่อมที่แข็งแรง)"
        ],
    },
    {
        "id": 5,
        "title": "รถบรรทุกอ้อยที่มีดั๊มพ์ทุกคันต้องมีการล๊อคดั๊มพ์ของตัวกระบะ",
        "details": [
            "รถบรรทุกอ้อยที่มีดัมพ์ทุกคันต้องมีการล๊อคดัมพ์ของตัวกระบะ ตามมาตรฐานโรงงานกำหนด"
        ],
        "warnings": [
            "- เพื่อป้องกันไม่ให้กระบะยกขึ้น ขณะดั๊มพ์อ้อยซึ่งจะทำให้น้ำหนักรถไปอยู่ที่ท้ายรถ ทำให้ล้อรถบรรทุกข้าม Stopper และทำให้รถตกดั๊มพ์",
            "- ขนาด น๊อตยึด ต้องมีขนาดไม่น้อยกว่า M16"
        ],
    },
    {
        "id": 6,
        "title": "เสาหลักกันอ้อยหล่นด้านข้างต้องยึดให้แข็งแรง",
        "details": [
            "ในขณะดั๊มพ์อ้อยเสาเหล็กรถบรรทุกต้องไม่ตกสะพาน"
        ],
        "warnings": [
            "- ตรวจสอบความแข็งแรงของเสาค้ำ เนื่องจากเสาค้ำที่ไม่แข็งแรงจะทำให้เสาร่วงหล่นลงสะพานไซด์ ส่งผลกระทบต่อการลำเลียงอ้อยและกระบวนการหีบอ้อย",
            "- เสาที่ใช้ทำหลักต้องมีความแข็งแรง ไม่ใช้ต้นอ้อยทำเป็นเสากันอ้อยหล่น (เสาหลักต้องมีระยะห่าง 80-90 ซม.)",
        ],
    },
    {
        "id": 7,
        "title": "การต่อท้ายกระบะรถบรรทุกอ้อยรถตัด ชุดสลักปลดล็อคต้องแข็งแรงและสลักต้องการต่อยาวถึงท้ายกระบะ",
        "details": [
            "ในการปลดสลักท้ายรถบรรทุกอ้อย ต้องไม่เกิดอุบัติเหตุ"
        ],
        "warnings": [
            "- หากชุดสลักปลดสั้นทำให้คนต้องเอื้อมไปไกลเพื่อไปปลดสลัก อาจจะทำให้เกิดอันตราย คนพลัดตกลงไปในสะพาน ซึ่งเป็นอันตรายถึงชีวิต",
            "- จุดปลดสลักที่ไม่ถูกตำแหน่งส่งผลต่อความปลอดภัยกับคนขับรถในการปลดล็อค ซึ่งอาจตกสะพานหรืออ้อยทับได้"
        ],
    },
    {
        "id": 8,
        "title": "การยึดยางอะไหล่ ชุดล็อคยางอะไหล่ต้องไม่หลวมคลอนและใช้น็อตยึดยางให้แน่น",
        "details": [
            "ในขณะดั๊มพ์อ้อยล้ออะไหล่รถบรรทุกต้องไม่ตกสะพาน"
        ],
        "warnings": [
            "- ชุดยางอะไหล่ ถ้ายึดไม่แน่นหลุดเข้าไปในเครื่องจักรแล้ว จะส่งผลให้เครื่องจักรเสียหายและต้องหยุดหีบอ้อย",
            "- หากล้ออะไหล่หลุดออกจากตัวรถจะส่งผลให้ตกลงไปยังสะพานทำให้ต้องหยุดการหีบอ้อย"
        ],
    },
    {
        "id": 9,
        "title": "เหล็กรางรถไฟรับฝาท้ายต้องยึดติดแข็งแรง ไม่หลุดออกมาจากตัวรถและขวางทางอ้อย",
        "details": [
            "ในขณะดั๊มพ์อ้อยเหล็กรางรถบรรทุกต้องไม่ตกสะพาน"
        ],
        "warnings": [
            "- เหล็กรางรถไฟท้ายรถ ถ้าหลุดเข้าไปในเครื่องจักร จะทำให้เครื่องจักรเสียหาย ต้องหยุดหีบอ้อย"
        ],
    },
    {
        "id": 10,
        "title": "กันชนด้านท้าย และแผ่นบังโคลนจะต้องมีความสูงจากพื้นไม่น้อยกว่า 60 ซม.",
        "details": ["กันชนด้านท้ายรถต้องไม่ขวางการชน ระหว่างล้อรถบรรทุกกับ Stopper"],
        "warnings": [
            "- เพื่อป้องกันความเสียหายเวลารถถอยชนยันล้อ แผ่นบังโคลนจะส่งผลต่อการถอยรถ ล้อรถไม่ชน Stopper ส่งผลให้ตอนดั๊มพ์อ้อยจะสามารถขยับได้ แล้วทำให้รถบรรทุกตกดั๊มพ์"
        ],
    },
    {
        "id": 11,
        "title": "ลมยางล้อรถบรรทุกอ้อย ต้องมีความดันมากกว่า 130 ปอนด์/ตร.นิ้ว",
        "details": [
            "ล้อหลังรถบรรทุกต้องไม่ถอยข้าม Stopper ขณะดั๊มพ์อ้อย"
        ],
        "warnings": [
            "- ตรวจเนื่องจากแรงดันลมยางรถบรรทุกที่ถอยชน Stopper ถ้าต่ำกว่ามาตรฐาน สามารถทำให้ล้อข้าม Stopper ได้เมื่ออ้อยลงสะพาน"
        ],
    },
    {
        "id": 12,
        "title": "การต่อเติมท้ายรถบรรทุกอ้อยต้องแข็งแรง",
        "details": ["ในขณะดั๊มพ์อ้อยเหล็กท้ายรถบรรทุกต้องไม่ตกสะพาน"],
        "warnings": [
            "- กรณีท้ายรถบรรทุกยึดติดไม่แน่นกับตัวรถจะส่งผลให้ขณะดั๊มพ์อ้อย น้ำหนักอ้อยจะไปกดที่ท้ายรถบรรทุก ส่งผลให้ท้ายรถบรรทุกตกสะพาน ทำให้หยุดหีบอ้อย"
        ],
    },
]

@app.route("/")
def home():
    return render_template(
        "index.html",
        items=items,
        items_json=json.dumps(items, ensure_ascii=False) # แปลงค่าส่งให้ JS ใช้อย่างถูกต้อง
    )

if __name__ == "__main__":
    app.run(
        host="0.0.0.0",
        port=5000,
        debug=True
    )
